app/views/comments/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 14]]
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT ?  [["post_id", 14], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 13]]
---
</div>
    <% if @post.comments.any?%>
    <% @post.comments.each do |comment|%>